---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneId.op_Equality(Autodesk.Revit.UI.DockablePaneId,Autodesk.Revit.UI.DockablePaneId)
source: html/8ee441b9-70dc-8a1c-5b7b-983220343e0e.htm
---
# Autodesk.Revit.UI.DockablePaneId.op_Equality Method

Compares two DockablePaneId instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	DockablePaneId first,
	DockablePaneId second
)
```

## Parameters
- **first** (`Autodesk.Revit.UI.DockablePaneId`) - The first DockablePaneId.
- **second** (`Autodesk.Revit.UI.DockablePaneId`) - The second DockablePaneId.

## Returns
True if the inputs are identical, false if they are different.